In [59]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
df = pd.read_excel("~/Documents/Statistical-Analysis/Xm02-04 CP1.xlsx", sheet_name='Sheet1')
df.columns

Index(['Reader', 'Occupation', 'Newspaper'], dtype='object')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 354 entries, 0 to 353
Data columns (total 3 columns):
Reader        354 non-null int64
Occupation    354 non-null int64
Newspaper     354 non-null int64
dtypes: int64(3)
memory usage: 8.4 KB

In [24]:
df.head()

   Reader  Occupation  Newspaper
0       1           2          2
1       2           1          4
2       3           2          1
3       4           3          2
4       5           1          3

In [30]:
df.groupby(['Occupation', 'Newspaper']).count()

                      Reader
Occupation Newspaper
1          1              27
           2              18
           3              38
           4              37
2          1              29
           2              43
           3              21
           4              15
3          1              33
           2              51
           3              22
           4              20